Revit 2027 API
IFCImportOptions.LinkPosition Property
 The position of the Linked IFC File in the Host Document.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCLinkPosition LinkPosition { get; set; }
Public Property LinkPosition As IFCLinkPosition
	Get
	Set
public:
property IFCLinkPosition LinkPosition {
	IFCLinkPosition get ();
	void set (IFCLinkPosition value);
}
member LinkPosition : IFCLinkPosition with get, set
Property Value
IFCLinkPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Link Orientation only applies during a Link IFC operation.
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace